test/dummy/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 17 Mar 2013 07:42:08 UTC +00:00], ["name", "yas"], ["updated_at", Sun, 17 Mar 2013 07:42:08 UTC +00:00]]

  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'hsy', "updated_at" = '2013-03-17 07:42:46.645497' WHERE "users"."id" = 1